tap "bufbuild/buf"
tap "golangci/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "oven-sh/bun"
tap "rcmdnk/file"
tap "sanemat/font"
brew "pycparser"
brew "cffi"
brew "python@3.12"
brew "awscli"
brew "cmake"
brew "cocoapods"
brew "direnv"
brew "docutils"
brew "libgit2"
brew "exa"
brew "gh"
brew "git"
brew "node"
brew "gitmoji"
brew "glib"
brew "jq"
brew "keyring"
brew "libfido2"
brew "libomp"
brew "llvm@16"
brew "make"
brew "mas"
brew "mycli"
brew "mydumper"
brew "protobuf"
brew "mysql"
brew "mysql-client"
brew "neovim"
brew "pnpm"
brew "poetry"
brew "postgresql@14"
brew "postgresql@16"
brew "pre-commit"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "rbenv"
brew "rust"
brew "rustup"
brew "rye"
brew "shellcheck"
brew "sqlfluff"
brew "starship"
brew "terraform", link: false
brew "tfenv"
brew "tflint"
brew "tmux"
brew "tree"
brew "virtualenv"
brew "wget"
brew "yarn"
brew "bufbuild/buf/buf"
brew "golangci/tap/golangci-lint"
brew "oven-sh/bun/bun"
brew "rcmdnk/file/brew-file"
cask "alfred", args: { appdir: "/Applications" }
cask "cheatsheet", args: { appdir: "/Applications" }
cask "chromedriver"
cask "deepl", args: { appdir: "/Applications" }
cask "discord", args: { appdir: "/Applications" }
cask "docker", args: { appdir: "/Applications" }
cask "figma", args: { appdir: "/Applications" }
cask "font-agave-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-hackgen-nerd"
cask "ghostty"
cask "goland", args: { appdir: "/Applications" }
cask "google-chrome", args: { appdir: "/Applications" }
cask "google-drive", args: { appdir: "/Applications" }
cask "hammerspoon"
cask "intellij-idea", args: { appdir: "/Applications" }
cask "iterm2"
cask "mactex"
cask "miniconda"
cask "ngrok", args: { appdir: "/Applications" }
cask "notion", args: { appdir: "/Applications" }
cask "pgadmin4"
cask "postman", args: { appdir: "/Applications" }
cask "pycharm", args: { appdir: "/Applications" }
cask "raycast"
cask "session-manager-plugin"
cask "slack", args: { appdir: "/Applications" }
cask "sourcetree", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "warp", args: { appdir: "/Applications" }
cask "zoom", args: { appdir: "/Applications" }
mas "GarageBand", id: 682658836
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "LINE", id: 539883307
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "MouseCatch", id: 1625127067
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
