cask_args appdir: "/Applications"

tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "sanemat/font"

brew "git"
brew "gitmoji"
brew "mas"
brew "shellcheck"
brew "tree"
brew "volta"
brew "wget"
brew "gh"
brew "starship"
brew "shellenv"

cask "intellij-idea"
cask "goland"
cask "pycharm"
cask "cheatsheet"
cask "deepl"
cask "discord"
cask "docker"
cask "figma"
cask "google-chrome"
cask "google-drive"
cask "ngrok"
cask "notion"
cask "postman"
cask "slack"
cask "sourcetree"
cask "visual-studio-code"
cask "warp"
cask "zoom"
cask "alfred"
cask "iterm2"
cask "dbeaver-community"

mas "LINE", id: 539883307
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
