4ops.terraform
amazonwebservices.aws-toolkit-vscode
anysphere.pyright
aprilandjan.ascii-tree-generator
arjun.swagger-viewer
azemoh.one-monokai
bierner.markdown-mermaid
bpruitt-goddard.mermaid-markdown-syntax-highlighting
burkeholland.simple-react-snippets
charliermarsh.ruff
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
codezombiech.gitignore
cweijan.dbclient-jdbc
cweijan.vscode-database-client2
dart-code.dart-code
dart-code.flutter
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
dsznajder.es7-react-js-snippets
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
fabiospampinato.vscode-monokai-night
figma.figma-vscode-extension
formulahendry.auto-rename-tag
github.copilot
github.vscode-github-actions
golang.go
hashicorp.terraform
hediet.vscode-drawio
infeng.vscode-react-typescript
jakob101.relativepath
james-yu.latex-workshop
janisdd.vscode-edit-csv
jasonnutter.search-node-modules
jawandarajbir.react-vscode-extension-pack
jprestidge.theme-material-theme
kingwl.ts-react-hooks-tools
mhutchie.git-graph
mosapride.zenkaku
mquandalle.graphql
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vsliveshare.vsliveshare
pkief.material-icon-theme
pmneo.tsimporter
prisma.prisma
qwtel.sqlite-viewer
rangav.vscode-thunder-client
redhat.vscode-yaml
ritwickdey.liveserver
saoudrizwan.claude-dev
sburg.vscode-javascript-booster
steoates.autoimport
streetsidesoftware.code-spell-checker
styled-components.vscode-styled-components
taichi.vscode-textlint
tomoki1207.pdf
tomoyukim.vscode-mermaid-editor
vscode-icons-team.vscode-icons
vscodevim.vim
vstirbu.vscode-mermaid-preview
withfig.fig
xabikos.javascriptsnippets
xabikos.reactsnippets
yoavbls.pretty-ts-errors
yzane.markdown-pdf
