aprilandjan.ascii-tree-generator
azemoh.one-monokai
burkeholland.simple-react-snippets
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
codezombiech.gitignore
cweijan.vscode-database-client2
dbaeumer.vscode-eslint
dracula-theme.theme-dracula
dsznajder.es7-react-js-snippets
eamodio.gitlens
esbenp.prettier-vscode
fabiospampinato.vscode-monokai-night
formulahendry.auto-rename-tag
gencay.vscode-chatgpt
genieai.chatgpt-vscode
GitHub.copilot
GraphQL.vscode-graphql
GraphQL.vscode-graphql-syntax
infeng.vscode-react-typescript
jasonnutter.search-node-modules
jawandarajbir.react-vscode-extension-pack
jprestidge.theme-material-theme
kingwl.ts-react-hooks-tools
kiranshah.chatgpt-helper
monokai.theme-monokai-pro-vscode
mosapride.zenkaku
ms-azuretools.vscode-docker
MS-CEINTL.vscode-language-pack-ja
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
oderwat.indent-rainbow
orsenkucher.vscode-graphql
PKief.material-icon-theme
pmneo.tsimporter
Prisma.prisma
rangav.vscode-thunder-client
rebornix.ruby
ritwickdey.LiveServer
ryu1kn.partial-diff
sburg.vscode-javascript-booster
streetsidesoftware.code-spell-checker
styled-components.vscode-styled-components
TechTrain.railway-vscode
tinkertrain.theme-panda
twxs.cmake
vscode-icons-team.vscode-icons
wingrunr21.vscode-ruby
xabikos.JavaScriptSnippets
xabikos.ReactSnippets
