aprilandjan.ascii-tree-generator
Arjun.swagger-viewer
azemoh.one-monokai
bierner.markdown-mermaid
burkeholland.simple-react-snippets
charliermarsh.ruff
chris-hayes.chatgpt-reborn
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
codezombiech.gitignore
cweijan.dbclient-jdbc
cweijan.vscode-database-client2
dbaeumer.vscode-eslint
dracula-theme.theme-dracula
dsznajder.es7-react-js-snippets
eamodio.gitlens
EditorConfig.EditorConfig
esbenp.prettier-vscode
fabiospampinato.vscode-monokai-night
figma.figma-vscode-extension
formulahendry.auto-rename-tag
gencay.vscode-chatgpt
GitHub.copilot
GitHub.copilot-chat
golang.go
GraphQL.vscode-graphql
GraphQL.vscode-graphql-syntax
hediet.vscode-drawio
infeng.vscode-react-typescript
jakob101.RelativePath
jasonnutter.search-node-modules
jawandarajbir.react-vscode-extension-pack
jprestidge.theme-material-theme
kingwl.ts-react-hooks-tools
kiranshah.chatgpt-helper
mhutchie.git-graph
monokai.theme-monokai-pro-vscode
mosapride.zenkaku
ms-azuretools.vscode-docker
MS-CEINTL.vscode-language-pack-ja
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vsliveshare.vsliveshare
oderwat.indent-rainbow
orsenkucher.vscode-graphql
PKief.material-icon-theme
pmneo.tsimporter
Prisma.prisma
qwtel.sqlite-viewer
rangav.vscode-thunder-client
redhat.vscode-yaml
ritwickdey.LiveServer
ryu1kn.partial-diff
sburg.vscode-javascript-booster
Shopify.ruby-lsp
steoates.autoimport
streetsidesoftware.code-spell-checker
styled-components.vscode-styled-components
TechTrain.railway-vscode
tinkertrain.theme-panda
twxs.cmake
vscode-icons-team.vscode-icons
vscodevim.vim
withfig.fig
xabikos.JavaScriptSnippets
xabikos.ReactSnippets
