aprilandjan.ascii-tree-generator
burkeholland.simple-react-snippets
codezombiech.gitignore
dsznajder.es7-react-js-snippets
eamodio.gitlens
esbenp.prettier-vscode
formulahendry.auto-rename-tag
infeng.vscode-react-typescript
kingwl.ts-react-hooks-tools
mosapride.zenkaku
ms-azuretools.vscode-docker
MS-CEINTL.vscode-language-pack-ja
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
oderwat.indent-rainbow
PKief.material-icon-theme
rebornix.ruby
ritwickdey.LiveServer
ryu1kn.partial-diff
sburg.vscode-javascript-booster
streetsidesoftware.code-spell-checker
styled-components.vscode-styled-components
TechTrain.railway-vscode
twxs.cmake
vscode-icons-team.vscode-icons
wingrunr21.vscode-ruby
xabikos.JavaScriptSnippets
yzane.markdown-pdf